Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 两人出了木屋，安度因想了很久，才出声问林立：“知道我为什么不教你新的法术，反而一直让你练习元素排列吗？”
en_us: They stepped out of the log cabin. Andoine thought for long while before asking Lin Li, “Do you know why I stopped teaching you new spells, and instead had you practice elemental sequencing?”

source: 两人又说了会话，林立却突然发现，希恩身上的皮甲，好象还没有换过，仍然是在黑山镇是所穿的那件：“对了希恩，你怎么不换件皮甲？”
en_us: The two continued the conversation for a while longer when Lin Li suddenly realized it seemed that Sheehan had not changed his leather armor since he was at Black Hill Town, "Oh yes, Sheehan, why have you not changed your leather armor?"

source: 两人啃完肉干，江逸再次给小奴检查了一遍伤势，确定没有伤到骨头后，让她自己回房找春芽帮她敷上药膏，还交代几句，今日之事千万别给家族的人知道了。
en_us: Both having finished their jerky, Jiang Yi once again checked Xiaonu's wounds. Confirming that she did not have any injured bones, he got her to return home to find Chunya to help her apply ointment, while instructing her not to let any of the family members know what happened that day.

source: 两人在武器架前转了一圈，实在没什么太好的货色，就在林立打算闭着眼睛，先买一件将就将就的时候，却忽然在一片货架上，感受到了一丝轻微的魔法波动。
en_us: The two men paced another round around the racks but nothing in particular caught their attention. When Lin Li decided to make do with whatever item picked at random, a faint magical wave in somewhere among the racks suddenly captured his interest.

source: 两人在水晶球旁，等到大概凌晨时分，就在两人都心急如焚的时候，一直没有动静的水晶球，终于亮了起来！
en_us: The two of them waited by the crystal ball till the wee hours. Just as the two of them were in a state of extreme anxiety, the crystal ball, which had been silent, lit up finally!

source: 两人在街上看了一圈之后，走进了一间叫镀金玫瑰的魔法商店中。
en_us: After taking a look around the street, they walked into a magic store called Gilded Rose.

source: 两人在那一番推辞，最后艾萨克终于还是没能拗过葛瑞安，硬是被他把一瓶奥法药剂塞进了手里。
en_us: After a round of declining from each side, Isaac couldn't win Gerian at last, and a bottle of Arcane Magic Potion was stuffed into his hand.

source: 两人在那闲扯了几句，正打算往宴会大厅里走，却被眼尖的城主大人给认了出来。
en_us: The two talked for a little while and were about to enter the banquet hall when they were recognized by the eagle-eyed Castellan.

source: 两人很快到了会客室外，林立刚一推开门，就看见一张正哭得梨花带雨的俏脸。
en_us: The two of them reached the reception room promptly. As soon as Lin Li pushed open the door, a weeping beauty came into sight.

source: 两人性子很稳重，站在门口不远的一名铸鼎境三重的旁系子弟脾气却很是火爆，不等江如虎开口，伸手指着江逸鼻子骂道：“你算什么东西？滚出去！”
en_us: The two of them remained calm, but at the door, the collateral descendant who was of third stage of the Cast Tripod Realm had a fiery temper. Before Jiang Ruhu had the chance to speak, he pointed at Jiang Yi's nose and berated, "Who do you think you are? Get out of here!"

source: 两人找了个僻静角落密谈，旁边一群人，却早已经看得目瞪口呆……
en_us: The two of them sound a quiet corner for a private discussion. The people around them were dumfounded.

source: 两人正在那窃窃私语，却听见一阵喧哗声从翡翠高塔外传来，抬眼望去，正看见一名衣饰华贵的中年男人走进塔内，远远望去这人大约四十多岁，面色略显苍白，神色间却又透出一股威严。
en_us: The two of them were whispering when a clamor was heard outside the Emerald Tower. Looking up, they saw a middle-aged man in luxurious clothing entering the tower. From a distance, he looked to be about 40 year old; his face was slightly pale, but he exuded an air of authority.

source: 两人正有一句没一句的闲聊着，却忽然听见远处一声惊叫传来。
en_us: The two men were chatting away when, suddenly, a scream broke out in the distance.

source: 两人用尽了全身的力气，终于是在人群中挤出了一丝缝隙。
en_us: With all their strength, they finally squeezed out into a gap in the crowd.

source: 两人的目光，都是同样呆滞，远远望着树林中的一老一少，半天也没能说出一句话来，刚才那一幕实在是太诡异了，年纪轻轻的费雷，指点起安度因这位传奇法师来，却是显得无比自然，就好象这一切都是天经地义似的。
en_us: All life had been drained from both of their eyes. They gazed at the old and young together at a distance, not being able to speak fro a while. The scene they had just witnessed was simply too bizarre. The young Felic was instructing Andoine, a legendary mage, but this seemed hardly strange, as if it were perfectly justified.

source: 两人的魔力几乎是同一时间耗尽，从空中缓换落下，靠的仅是漂浮术的缓冲。
en_us: They had exhausted their mana almost at the same time. The slow descend was merely a buffer with the Levitation Spell.

source: 两人说话的时候，十瓶奥法药剂的价格，已经被人抬到了四十万。
en_us: While the two men were talking, the price for the ten bottles of Arcane Magic Potion was raised to 400,000.

source: 两人走进黑市，就象走进了斗兽场中。
en_us: Walking into the black market was like walking into a Colosseum.

source: 两人跟葛瑞安打过招呼之后，就出了翡翠高塔，沿着冷清的街道一路往加洛斯城内走去。
en_us: The two guys left the Emerald Tower after informing Gerian. They walked along a deserted street towards Jarrosus City.

source: 两人这么一问一答，一路上倒也不算无聊。
en_us: The way one questioned and another answered had kept the journey away from boredom.

source: 两人都受了伤，好在毒打江小奴的那个壮汉没有动用元力，江小奴只是受了些皮外伤，并没有伤筋动骨，否则怕是江逸都不知道怎么回去了。
en_us: Both of them were injured, but thankfully the strongman who brutally beat Jiang Xiaonu did not use any essence force, so all Jiang Xiaonu received were some surface wounds. She thankfully hadn’t sustained any muscular or skeletal injuries, otherwise Jiang Yi would have no idea how to bring her back home.

source: 两人都是铸鼎境五重，在他们看来，江逸虽然实力进步得诡异但还不足为虑。两人一开始没出手，只是不想搅入江如虎的破事中，但此刻怎能眼睁睁看着江如虎被打断双腿？
en_us: Both of them were at the fifth stage of the Cast Tripod Realm. In their eyes, Jiang Yi wasn't of any threat even though he had a drastic progression in strength. They initially didn't want to get involved with the matters of Jiang Ruhu, but how could they witness the breaking of Jiang Ruhu's legs?

source: 两位大魔导士都有瞬发低级魔法的能力，甚至比林立更加精通，但是他们从头到尾，却从未瞬发过任何一个魔法，因为他们心里很清楚，自己能够瞬发的魔法，根本就无法给对方造成任何威胁。
en_us: The two archmages here possessed the ability to unleash low-level magic instantaneously, and were even adept at that as compared to Lin Li. But they had never had any instantaneous outburst of magic since the start of the battle. For they knew clearly that the instant magic outbursts they could unleash would never pose as a threat to the other.

source: 两名英俊公子陪着姬听雨一路走来，豪气干云的大笑声响彻大殿内，江恨水倒是没有开口，不过目光一直锁定姬听雨小姐，眸子内都是炙热。
en_us: With their heroism and bravery reaching the heavens, the loud laughter coming from two of the handsome gentlemen who followed Ji Tingyu walk into the hall rang throughout the Great Hall. Jiang Henshui, on the other hand, did not open his mouth. Nonetheless, his gaze had always been locked onto Young Mistress Ji Tingyu, with his pupils revealing a look of fiery passion.

source: 两大势力一旦撕破了脸，加洛斯立刻就会陷入混乱当中。
en_us: Once the two powers turned against each other, the whole of Jarrosus would fall into a turmoil.

source: 两条大汉都打着赤膊，神色凶狠一脸横肉，一看就是在打打杀杀中厮混出来的，林立摸了摸鼻子，带着几分怯意小声答道：“卖东西的……”
en_us: The burly men were shirtless, their expressions ferocious and ugly. At a glance, they seemed to have came from knocking around places fighting and killing. Lin Li touched his nose and replied timidly, "I came to sell items..."

source: 两相比较之下，精通医术的罗琳，其实更适合成为林立的学生，医术与药剂，有着太多共通之处，林立甚至可以肯定，只要自己愿意尽心尽力指导的指导她一下，年纪轻轻就医术高明的罗琳，恐怕还用不了一年的时间，就可以在药剂学上取得不错的成就。
en_us: By comparison, Rowling, who was proficient in medicinal studies, was actually more suitable to become Lin Li's student. Medicinal studies and potion making had too much in common. Lin Li could even be sure that as long as he was willing to guide her with all his heart, Rowling, with her superior medical skills at such a young age, would be able to achieve good results in pharmaceutics within a year.

source: 中午起来的时候，因为麦德林催得急，林立连饭都没来得及吃，在噩梦山脉上一番折腾，早就已经饿得前胸贴后背了，这家伙一路走进公会大厅，就在那一路四处张望，想看看有没有什么能吃的东西，可以拿来先垫垫肚子。
en_us: When they got up at noon, Lin Li had yet to have his lunch as Medellin hurried them to move. Thus, he had been starving for hours after a long, tough journey through the Nightmare Mountains. This fellow was looking around along the way to the guild's hall, hoping to find something edible to relieve his hunger momentarily.

source: 中年人从树丛间走出，目光直直的盯着林立：“你是不是叫费雷？”
en_us: The man emerged from the bushes. He stared Lin Li straight in the eye and asked: "Are you Felic?"

source: 中年人手中的元力隐入身体，满脸怒容四处一扫，沉喝道：“还愣着干什么？还不把伤者带去疗伤？其余所有人全部带去刑堂，你们这群王八羔子无法无天了？”
en_us: The essence force went back into the body of the middle-aged man, looking around with an furious expression, he shouted, "What are you all still standing there for? Why aren't you bringing the injured to recuperate? Everyone else is to be sent to the Disciplinary Court. You bunch of bastards are truly lawless uh?"

source: 中年人点了点头，没有多说什么，只是望向林立的目光，却是越发的凌厉。
en_us: The middle-aged man nodded his head. He said nothing more, but his gaze towards Lin Li instead was more intense than ever.

source: 中年人神神秘秘的重谢，弄得林立心里有些七上八下，心头还在那暗自揣测，该不会是凯文在外面搞下了什么风liu债，又不敢告诉葛瑞安，现在人家找上门来了吧……
en_us: The mysterious gratitude of the middle-aged man made Lin Li feel a little anxious. In his heart he was speculating that Kevin might have run up to some romantic debt and didn't dare to tell Gerian, but now the person had come looking for him...

source: 中年人老板的态度，让林立多多少少有些好感，他看得出来，这是一个正正经经的生意人。
en_us: The shop owner, who was a decent businessman as far as Lin Li could tell, left a somewhat good first impression.

source: 中年男人没有想到，这个看起来强大而神秘的少年魔法师，竟是如此的平易近人，一时间多多少少有些受宠若惊，当下又是一番诚恳的致谢，然后才为他介绍起一行三人来。
en_us: The middle-aged man had not expected the seemingly powerful yet mysterious young mage could be this amiable and easy to approach. He was rather flattered and expressed his sincere gratitude all over again before introducing his party of three to him.

source: 中间葛瑞安又过来关心了几次，在看到这一瓶瓶奥法药剂的时候，胖老头差点没把舌头给咬掉，本来不看都已经惦记上了，这下看到了就更不得了了，老家伙就象是饥渴了几十年的久旷怨妇似的，死活赖在药剂室里不肯走，非要林立给他弄两瓶尝尝不可。
en_us: Gerian had come to watch a few times. When he saw the bottles of Arcane Magic Potion, the fat old man nearly bit his tongue off. It had been on his mind even without looking at them, but now that he had seen them, he was behaving like an aggrieved woman who hadn't been satisfied for decades, refusing to leave the potion lab and insisting on getting two bottles for him to have a taste.

source: 丹田内还有一缕刚刚提炼出来的黑色元力，江逸立即调集过来，继续开始冲击封印。结果他又成功让封印上的一枚符文消融了……
en_us: There was still a strand of recently refined black essence force in his dantian. Jian Yi hastily summoned that strand over and used it to continue battering the seal. Once again, he successfully caused yet another runic character on his seal to dissipate...

source: 丹药是江逸自己炼制的，江逸自然毫不在意的点头道：“知道的，如果不知道，那不是变成我偷的吗？”
en_us: The elixirs were developed by Jiang Yi himself, so he naturally nodded without minding about the question. He replied, "Yes, of course he knows! Would it not be considered that I was stealing if he doesn't know?"

source: 为了冲击附魔专业，林立几乎动用了所有的关系，就为了在点金棒上镀上一层深邃之银，可这东西实在是太稀有了，全无尽世界似乎都没人见过，那段时间林立天天都蹲在拍卖行，佣兵公会的私人委托更是常年挂着，报酬一天一小加三天一大加，可就是没见谁把这东西给拿出来过。
en_us: In order to jolt his magical enchantment profession, Lin Li had used all his connections just to coat the gold rod with one layer of deep silver. But this stuff was just too rare, almost no one had seen it in the Endless World. For that period of time, Lin Li spent his days squatting at the auction house. The Mercenary Guild's private commission was hung all year round, and the reward was increased by a small amount every day and then saw a huge increase every three days, but no one had ever brought the stuff out.

source: 为了跟老格林探讨，他甚至可以容忍罗琳旁听，以林立那倔强的性格，这可是相当难得的一件事……
en_us: In order to discuss with Old Grimm, he could even tolerate Rowling's presence, which was a very rare thing with his obstinacy.

source: 为了这个机会，他甚至不惜让自己暴露在狮蝎的利爪之下。
en_us: He'd even exposed himself to the claws of the Manticore for this opportunity.

source: 为了追求这个长腿美女，克伦威尔用尽了一切的手段。
en_us: Cromwell had used all kinds of means to win the heart of this long-legged beauty.

source: 为了避免金发美女又问到自己的来历，林立干脆主动找些话题跟她聊了起来，对林立来说聊的内容其实不重要，重要的是不能让她有时间发问！
en_us: To avoid another questioning of his background from Ina, Lin Li took the initiative to bring up some topics to chat with her. For Lin Li, the content of the conversation was not important, what was more important was not to let her have the time to raise questions.

source: 为什么会觉得这个中年人眼熟，原来竟是因为他跟巴瑟罗尔长得有七八分相似，特别是手上戴的那一枚红宝石戒指，林立的印象实在是太深刻了，当初在城主府宴会上，自己就差点伤在这枚红宝石戒指下面。
en_us: Why he had felt that his middle-aged man looked familiar, was because he looked largely similar to Bathrilor, especially the ruby on his ring finger. Lin Li's impression of this was just too vivid. At that time during the banquet, he had almost injured himself due to the bottom of this very ruby.

source: 为自己赢得了暂时的喘息机会之后，林立再不敢耽搁任何时间了，打开无尽风暴之戒，从里面摸出了一瓶蓝色药水。
en_us: After earning a temporary respite for himself, Lin Li dared not hesitate any longer. He opened up the Ring of Endless Storm and pulled out a bottle of blue potion.

source: 之后他又打开了无尽风暴之戒，而这一次拿出的，是一支由水晶雕琢而成的水晶笔。
en_us: Then, he opened up the Ring of Endless Storm and this time took out a crystal pen carved from crystal.

source: 之后安度因又说了些什么，林立已经有些不太记得了，一直到老法师的背影在视线中渐渐模糊，林立才忽然想起件重要的事来。
en_us: Subsequently, Lin Li could no longer remembered what Andoine had said. It was only when Andoine’s back disappeared into the distance that Lin Li suddenly recalled an important matter.

source: 之后就是等待冷却，与一般金属不同，魔法金属不能强行冷却，否则会导致金属中的魔法属性大量流失，林立现在能做的就是耐心等待。
en_us: Then, he waited for it to cool. Unlike ordinary metals, magical metals could not be forced to cool down, otherwise, it would cause a huge loss of magical properties in the metal. What Lin Li could do was only to wait patiently.

source: 之后数十年过去，格林－伯恩塞德在药剂学上已有大师级水准，即便是在药剂师公会内部，也绝对算是能说上话的重要人物。
en_us: Decades had passed since then and Grimm Burnside was already at the mastery level in pharmaceutics. Even within the Pharmacists Guild, he was definitely an important person who had a say in the guild.

source: 之后的一个多月里，安度因缺草药的时间越来越多。
en_us: For the following few months, Andoine frequently lacked in herbs.

source: 之后的一个月，林立就一直住在落日山脉，除了偶尔在药剂学上指点一下安度因之外，他绝大部份的时间都用到了学习魔法上，因为他发现自己确实很有魔法天赋，就连老安度因也不得不承认，自己活了一百多岁，还从来没见过这么出众的魔法天赋。
en_us: Lin Li stayed in the Sunset Mountains for the following month. Other than occasionally guiding Andoine in pharmaceutics, he spent most of his time learning magic. He discovered he had a gift in magic, and even old Andoine, who had lived for over a hundred years, had to admit he had never seen someone with such an exceptional talent in magic as Lin Li.

source: 之后的一切对他来说，简直就是一场噩梦。
en_us: All that followed was simply a nightmare to him.

source: 之后的几天里，他再没出过房门半步，就连奥法药剂的拍卖都没空去关心，只是将自己锁在房里，静心思索着那一场战斗中的点点滴滴，两人的每一句咒语每一个手势，都被林立拿出来反复研究。
en_us: For the subsequent few days, he had not stepped out of his room. He did not even have the time to care about the auction of the Arcane magic potions. He'd locked himself up in the room and calmly pondered over every bit of the battle. Lin Li had studied repeatedly each spell and gesture that both of them had used.

source: 之后的几天里，老法师有些苦恼，因为他完全不知道，自己还有什么能教给林立的。
en_us: The following few days, Andoine was troubled as he was completely clueless what else he could teach Lin Li.

source: 之后的几天，一切风平浪静，姬听雨再也没有出现过，江恨水和江如龙也没露面，江逸每天在武殿和西山江家大院三个地方转圈，除了陪翊凌雪对练外就是修炼，日子倒是过得充实惬意。
en_us: All was peaceful and calm over the next few days. Ji Tingyu did not appear again, Jiang Henshui and Jiang Rulong did not show their faces either. Jiang Yi spent every single day running between the Martial Arts Hall, the Western Hills and the Jiang Residence Central Courtyard, only either sparring in combat with Ji Tingyu or conducting power cultivation. His days passed by rather substantially and satisfactorily.

source: 之后的几天，林立忙得不可开交。
en_us: For the next few days, Lin Li was up to his ears in work.

source: 之后魔力输出缓慢增加，林立手上的火苗也是越烧越旺，在那熊熊的烈火之下，附在点金棒上的深邃之银开始慢慢融化，这中间需要的是无比精确的控制，任何一丝失误，都可能会导致价值连城的深邃之银化为乌有，就连向来镇定的林立，此时额头上也是不由冒出了细密的汗珠……
en_us: Thereupon, the mana output was slowly increased, and the flame on Lin Li's hand burned more vigorously. The deep silver adhered on the gold rod began to melt under the blazing flame. Precise control was required. Any slight mistake could turn the valuable deep silver into nothing. Even Lin Li, who had always been calm, couldn't stop fine beads of sweat from breaking out on his forehead...

source: 九阳天帝！
en_us: Nine Yang Celestial Thearch!

source: 也不知道今天是什么日子，城主府内张灯结彩灯火通明。
en_us: There seemed to be some celebration today; the Castellan Mansion was brightly lit with lights.

source: 也不知道究竟是为什么，林立总是觉得，老头脸上的笑容有些居心叵测。
en_us: For reasons unknown, Lin Li constantly felt that the smile on the old man's face was somewhat sinister.

source: 也不知道那死猩猩从哪里搞来这么多椰子，一通*般的乱砸，至少弄了数百个椰子下来。
en_us: Who knew where the darned gorilla got the coconuts from—at least hundreds of them came smashing down in a mess.

source: 也只有这三种魔法金属，才会让林立伤透脑筋。
en_us: Only these three magical metals would task Lin Li's mind.

source: 也就是说，这道诡异的封印，才是小江逸元力修行速度上不去的罪魁祸首！
en_us: In other words, this bizarre seal was the culprit behind the young Jiang Yi’s abysmally slow cultivation speed!

source: 也幸亏林立在安度因木屋里住了一个多月，在这一个多月的时间里，虽然只学会了十个低级法术，但在施法手段上却远比一般法师娴熟。
en_us: It was a fortunate thing that Lin Li had been living in Andoine's log cabin for more than a month. In this past month, though he had only learnt ten low-level spells, he was far more adept in his execution of the spells than an average mage.

source: 也幸亏这个时候，葛瑞安正忙着跟林立说话，压根没注意到他大逆不道的心思。
en_us: Luckily for him, Gerian was too busy talking to Lin Li to notice his rebellious thoughts.

source: 也幸亏这炼金室里没什么人，这话若是说了出去，多半是要挨雷劈的……
en_us: Fortunately, there was no one in the alchemy lab. If these words went out he would most likely be struck by lightning...

source: 也正是因为这个原因，葛瑞安现在才没有轻举妄动，虽然他已经占据了绝对的上风，只要他愿意，完全可以凭着一瓶唤醒药剂的优势，将老梅林父子杀死在翡翠高塔外，但这又怎么样，梅林家族不是魔法公会，他们的实力来源于财富与权势，失去了老梅林这个大魔导士，对他们来说并不致命，而之后的报复，则会让加洛斯城陷入混乱当中。
en_us: It was for this reason that Gerian had not acted rashly. He had gained a definite upper hand, and if he was willing, he could always rely on one bottle of Awakening Potion to kill Old Merlin and his son outside the Emerald Tower. But what for? The Merlin Family was not the Guild of Magic, their strength came from wealth and authority. Losing Old Merlin, an archmage, would not be fatal to them, yet the revenge that'd come later on would plunge Jarrosus City into a chaos.

source: 也正是因为这样，林立才有些奇怪，冷不丁的问了一句：“谁教你的？”
en_us: It was because of this that Lin Li felt something was strange. He suddenly asked: "Who taught you to make this potion?"

source: 也许……
en_us: Perhaps...

source: 也许一些十级以上的魔法师，可以凭借着自己数十年来积累的经验，勉强瞬发两个一二级法术，但对更多的魔法师来说，瞬发只是一个遥不可及的梦境。
en_us: Perhaps some mages above the level ten could unleash two level-one and level-two spells in an instant with their decades of accumulated experience, but for many mages, instantaneous outburst was nothing but a distant dream.

source: 也顾不得去跟伊娜解释，猛的抓住麦格雷尼的衬衣袖子，只听“嗤啦”一声脆响，整条衣袖都被他给撕开了。再一看那条手臂上，果然有一条细细的黑线往胸口处蔓延……
en_us: Without bothering to explain to Ina, he grabbed McGrenn's shirt’s sleeve and with a sniffle, he tore it apart.Taking another look at the arm, there was indeed a thin black line spreading to chest...

source: 买好了灵神丹，他揣着仅剩下的十两银子匆匆离开，却径直朝广场南边的聚珍阁走去。
en_us: After buying the Spirit Pills, he kept the remaining ten taels of silver in his pocket and hastily left. However, he walked directly towards the Pearl Gathering Pavilion, which was situated at the south side of the city plaza.

source: 事关魔法公会命脉，林立也不敢再继续耽搁，只是跟艾萨克说了一声，就带着凯文回魔法公会去了。
en_us: As this involved the lifeblood of the Guild of Magic, Lin Li dared not tarry further. After informing Isaac, he set off for the Guild of Magic with Kevin.

source: 事实上他之所以来到加洛斯城，就是为了要看一看这个年轻的魔法师，在王都奥兰纳的时候，安度因将他吹得是上天入地无所不能，年纪尚不到二十，就已经在药剂学上取得了深不可测的天赋，本身更是足以媲美法师之神的魔法天才。
en_us: In fact, the reason why he came to Jarrosus City was to have a look at this young mage. At the capital Alanna, Andoine had lauded the latter to the skies like there was nothing impossible for him. At the age below 20, he had already had a profound gift in pharmaceutics and was a magic genius comparable to that of the God of Mages.

source: 事实上林立的猎人号，此时就停在明月城拍卖行内，那可是手持神话武器星辰之怒的超级猎人，法师不过是仓库小号而已。只不过也不知道是不是因为林立运气太好，当初只打算用来当仓库才建的法师小号，却神奇的分到了智力精神双满的极品属性，以至于后来林立总是很烦恼，这么极品的小号，究竟该用来干点什么才好……
en_us: In reality, Lin Li's hunter form was stationed in the auction house at the moment. He was a super hunter holding the legendary weapon, Stars of Fury. The mage was just a smurf account he used in the warehouse. However, he seemed to have an extraordinary luck. He had created a mage smurf intending to use it as a warehouse, but he had gotten one with top levels of mental and intellectual abilities, a mage of the highest grade. Lin Li always had trouble deciding what to do with such an exceptional smurf.

source: 事实上，他也想过将他封印正在破解，还有无名功法的事情告知家族，引起家族重视，那样所有问题都能迎刃而解。但想到这数年来江家没有人待见他，加上柳长老的事情，他又生怕江家迁怒于他，所以决定等实力突飞猛进实在瞒不住再说。
en_us: The truth was that he had also thought of revealing the fact that he was in the process of breaking his seal as well as the nameless cultivation technique to the family. He hoped to gain the respect of the clan and solve all his problems in one fell swoop. However, he had realized that no one in the Jiang Clan had ever liked him. When he took into account, the incident with Elder Liu, Jiang Yi was afraid that the Jiang Clan would take their anger out on him. As such, he decided to keep the fact that his power was improving by leaps and bounds as a secret, and only reveal it when he could no longer conceal it anymore.

source: 事实上，武装希恩这件事，林立早就有了打算。
en_us: Actually, Lin Li had long thought of a plan on arming Sheehan.

source: 事实就是这样，多放几个低级魔法，对林立来说根本没有任何影响。
en_us: That was the truth. Unleashing a few more low-grade spells had no effect on Lin Li at all.

source: 事情到了这个地步，话已经不用说了，这一个简单的动作就可以说明一切。
en_us: With such a progression, there was no need to say any further. One simple action could explain everything.

source: 二十五万买三瓶奥法药剂，平均价格已经远远超出了先前成交的几瓶，在很多人看来，这已经不是拍卖，而是在赌气了。
en_us: 250,000 for three bottles of Arcane Magic Potion; the average price had far exceeded the previous few bottles that were sold. To many, this was no longer an auction, but a fit of pique.

source: 二十五万这个数字，确实有些太狠了，富如达芙妮这样的小偷头子，也没敢再继续跟进。
en_us: 250,000 was indeed a ruthless bid. Even a wealthy thief leader like Daphne did not dare to follow through.

source: 二十人早早的分散开来，将他围在中间，所有人身上的元力都悄然运转，他无论朝哪边逃都会被缠住，继而陷入无穷无尽的围攻中。
en_us: The twenty persons had dispersed early on, leaving him surrounded in the centre. The essence forces on all of the persons' bodies were quietly being circulated. In whichever direction he thought of escaping, he would always remain trapped within, thereafter getting stuck in the middle of a neverending barrage of attacks from all sides.

source: 二十人！
en_us: Twenty people!

source: 二十八分钟的持续输出，这意味着数千个低级魔法，就算是换成传奇法术，也够他放出十几个来了，葛瑞安真的很想问问林立，你真的是人类吗？
en_us: Twenty-eight minutes of continuous output meant a few thousands of low-level magic spells. Even if they were legendary spells, this would be enough to unleash a dozen of them. Gerian had really wanted to ask Lin Li whether he was truly a human.

source: 二十几块神之金属刚一现身，整个私人仓库就顿时沸腾了。
en_us: The entire private warehouse seethed with excitement at the sight of these divinity metals.

source: 二十分钟的时候，两人已经冲动得想撞墙了，这究竟是人还是怪物？
en_us: At twenty minutes, both of them had the impulse to hit the wall. Was this a human or a monster?

source: 二品炼丹师，鹤大师就是其中一个。
en_us: Master He, second-grade alchemist, was one such individual.

source: 于是他应了声，随手拿了桌上古籍中的一本，才翻开第一页，眼前却是一花，只见那古籍书第一页中的数十个黑色小篆字体竟然依次从书中飞了出来，在半空中排列成整齐的一串，绕着他的脑袋旋转个不停。
en_us: Nodding at her encouragement, Jiang Yi picked up one of the books from the stack of ancient texts on the table. However, as soon as opened the first page, his vision was attracted by a dazzling blur. The tiny black font on the page flew out of the book and formed a circular-shaped sentence in midair, which began to orbit his head.

source: 于是他很放心的打开了无尽风暴之戒。
en_us: Feeling assured, he opened up the Ring of Endless Storm.

source: 于是他派出了克伦威尔，并让他带来了四条十四级咒语。
en_us: Therefore, he had sent Cromwell along with the four level-fourteen spells.

source: 于是克伦威尔少见的放下了矜持，拼命的在脸上挤出笑容，主动向翡翠高塔内的魔法师示起好来。
en_us: So, Cromwell put on his best behavior, something that he rarely did, and tried his best to force a smile on his face, taking the initiative to befriend the mages in the Emerald Tower.
